app/controllers/user_stocks_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 ORDER BY "stocks"."id" ASC LIMIT $2  [["ticker", "MSFT"], ["LIMIT", 1]]
INSERT INTO "user_stocks" ("user_id", "stock_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["stock_id", 2], ["created_at", "2021-08-27 07:05:54.851535"], ["updated_at", "2021-08-27 07:05:54.851535"]]
---
	def create
    stock = Stock.check_db(params[:ticker])
    if stock.blank?
      stock = Stock.new_lookup(params[:ticker])
      stock.save
    end
    @user_stock = UserStock.create(user: current_user, stock: stock)

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."user_id" = $1 AND "user_stocks"."stock_id" = $2 ORDER BY "user_stocks"."id" ASC LIMIT $3  [["user_id", 1], ["stock_id", 1], ["LIMIT", 1]]
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = $1  [["id", 1]]
---
  def destroy
    stock = Stock.find(params[:id])
    user_stock = UserStock.where(user_id: current_user.id, stock_id: stock.id).first
    user_stock.destroy