app/models/stock.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 ORDER BY "stocks"."id" ASC LIMIT $2  [["ticker", "AAPL"], ["LIMIT", 1]]
---
	def self.check_db(ticker_symbol)
		where(ticker: ticker_symbol).first